fe32/tutorials/rheoFoam/CrossSlot/Oldroyd-BRootk/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet_north
    {
        type            patch;
        nFaces          51;
        startFace       29340;
    }
    inlet_south
    {
        type            patch;
        nFaces          51;
        startFace       29391;
    }
    outlet_east
    {
        type            patch;
        nFaces          51;
        startFace       29442;
    }
    outlet_west
    {
        type            patch;
        nFaces          51;
        startFace       29493;
    }
    walls
    {
        type            wall;
        nFaces          480;
        startFace       29544;
    }
    frontAndBack
    {
        type            empty;
        nFaces          29682;
        startFace       30024;
    }
)


// ************************************************************************* //
